# addLeader Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnnotationSymbol..::..addLeader Method
AnnotationSymbol Class See Also
---
add a leader to this annotation symbol.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void addLeader()
```

Visual Basic
---
```text
Public Sub addLeader
```

Visual C++
---
```text
public:
void addLeader()
```

# See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace